app/views/books/index.html.erb

<%= book.name %>
<% if Subscribtion.exists?(:Book_id => book.id) %>
---
SELECT  1 AS one FROM "subscribtions" WHERE "subscribtions"."Book_id" = ? LIMIT ?  [["Book_id", 1], ["LIMIT", 1]]
SELECT "subscribtions".* FROM "subscribtions"

<% end %>
<% if Subscribtion.exists?(:Book_id => book.id, :User_id => current_user.id) %>
---
SELECT  1 AS one FROM "subscribtions" WHERE "subscribtions"."Book_id" = ? AND "subscribtions"."User_id" = ? LIMIT ?  [["Book_id", 1], ["User_id", 1], ["LIMIT", 1]]