app/controllers/books_controller.rb

  def index
    query_url = request.original_fullpath
    if query_url.include? "?"
      @books = Book.search(params[:src]).paginate(:page => params[:page], :per_page => 2)
---
SELECT  "books".* FROM "books" WHERE (name LIKE '%g%') LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books" WHERE (name LIKE '%g%')

  def create
    @book=Book.new(params[:book].to_unsafe_hash)
    @book.save
---
INSERT INTO "books" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "The Lord of the Ring 1 "], ["created_at", "2019-06-14 02:19:33.484127"], ["updated_at", "2019-06-14 02:19:33.484127"]]

  def update
    @book=Book.find(params[:id])
    @book.update(params[:book].to_unsafe_hash)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "Harry Potter 1"], ["updated_at", "2019-06-15 03:06:38.518228"], ["id", 5]]

  def subscribe
    puts current_user.Name
    @book = params[:book]
    if Subscribtion.exists?(:User_id => current_user.id, :Book_id => @book)
      @subb = Subscribtion.find(params[:Book_id => @book])
      put "Ok"
    else
      @subb=Subscribtion.create(:User_id => current_user.id,:Book_id => @book)
---
SELECT  1 AS one FROM "subscribtions" WHERE "subscribtions"."User_id" = ? AND "subscribtions"."Book_id" = ? LIMIT ?  [["User_id", 1], ["Book_id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "subscribtions" ("User_id", "Book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["User_id", 1], ["Book_id", 1], ["created_at", "2019-06-15 16:23:11.499163"], ["updated_at", "2019-06-15 16:23:11.499163"]]

  def unsubscribe
    @book = params[:book]
    @book=Subscribtion.where(:User_id => current_user.id,:Book_id => @book).first
    @book.destroy
---
SELECT  "subscribtions".* FROM "subscribtions" WHERE "subscribtions"."User_id" = ? AND "subscribtions"."Book_id" = ? ORDER BY "subscribtions"."id" ASC LIMIT ?  [["User_id", 1], ["Book_id", 1], ["LIMIT", 1]]
DELETE FROM "subscribtions" WHERE "subscribtions"."id" = ?  [["id", 1]]