app/controllers/users_controller.rb

  def create
    @user=User.new(params[:user].to_unsafe_hash)
    @user.save
---
INSERT INTO "users" ("Name", "Age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Name", "Kinjal"], ["Age", 30], ["created_at", "2019-06-06 17:01:01.096384"], ["updated_at", "2019-06-06 17:01:01.096384"]]

  def update
    @user=User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "Name" = ?, "Age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["Name", "Hardik"], ["Age", 29], ["updated_at", "2019-06-07 02:50:09.111745"], ["id", 7]]